In [1]:
import pandas as pd

In [2]:
# List of dictionary
myDict = [
    {"Name": "Siddhant", "Age": 33},
    {"Name": "Manish", "Age": 31},
    {"Name": "Kanai", "Age": 32},
    {"Name": "Ram", "Age": 34}
]

# creating a Dataframe from dictionary
df = pd.DataFrame.from_dict(myDict)
df

       Name  Age
0  Siddhant   33
1    Manish   31
2     Kanai   32
3       Ram   34

In [3]:
# Without inplace
df1 = df.set_index("Name")
df

       Name  Age
0  Siddhant   33
1    Manish   31
2     Kanai   32
3       Ram   34

In [4]:
df1

          Age
Name
Siddhant   33
Manish     31
Kanai      32
Ram        34

In [5]:
# With inplace=True
df.set_index("Nameinplace=True)
df

          Age
Name
Siddhant   33
Manish     31
Kanai      32
Ram        34